# 1. Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк
# и сохраните в переменные, выведите на экран.

num_1 = int(input('Введите число 1: '))
num_2 = int(input('Введите число 2: '))
str_1 = input('Введите строку 1: ')
str_2 = input('Введите строку 2: ')

print(f'Первое число: {num_1}')
print(f'Второе число: {num_2}')
print(f'Первая строка: {str_1}')
print(f'Втроая строка: {str_2}')
print(f'Сумма чисел: {num_1 + num_2}')
print(f'Объединеная строка: {str_1 + str_2}')
