# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчёта заработной
# платы сотрудника. Используйте в нём формулу: (выработка в часах*ставка в час) + премия.
# Во время выполнения расчёта для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv

hours, pay_hour, bonus = argv

# res = int(hours) * int(pay_hour) + int(bonus)
#
# print(res)

print(hours)
print(pay_hour)
print(bonus)
# Не понял как правельно передать параметры в скрипт
