"""
Задание 1.
Поработайте с переменными, создайте
несколько, выведите на экран.
Запросите у пользователя некоторые числа и
строки и сохраните в переменные,
затем выведитена экран.
"""


name = input('Напиши ак тебя зовут:  ')
print(f'Привет {name}')
n = int(input('А сколько тебе лет: '))
print(f'Тебя зовут {name} и тебе {n} лет')
